{
  "contact-me": "Contact me",
  "side-bar": {
    "about": "About",
    "skills": "Skills",
    "projects": "Projects",
    "experience": "Experience"
  },
  "about": {
    "title": "About me",
    "greeting": "Hello, I'm Roger",
    "paragraph1": "I am passionate about web development and have reinvented myself in this field. I love creating digital experiences that are functional, intuitive, and truly add value to users. To achieve this, I have built a strong foundation in technologies such as HTML, CSS, JavaScript, SQL, MongoDB, PHP, and Java, as well as frameworks like Angular, React, and Laravel. Throughout my training and personal projects, I have developed complete web applications, with special attention to user experience and optimization, applying UI/UX principles. One of my favorite projects was developing a Laravel API for accommodation bookings, which you can check out on my GitHub.",
    "paragraph2": "I'm not specialized in any one stack yet because I enjoy exploring everything web development offers and I'm eager to learn. I might find my focus in the future, but for now, I prefer to keep an open mind about any technology or knowledge since there's so much to discover and use in the world of development.",
    "paragraph3": "Before dedicating myself to development, I worked in customer service and process analysis, which helped me better understand the real needs of users and bring an analytical approach to my projects. Now, I am seeking my first professional challenge in web development, eager to contribute what I know, keep learning, and grow in a collaborative environment where continuous improvement is part of everyday work."
  },
  "skills": {
    "title": "Skills",
    "title-hard": "Hard Skills",
    "title-soft": "Soft Skills",
    "soft-skills": {
      "active-listening": {
        "name": "Active listening",
        "description": "Thanks to my previous experience, I developed a high level of active listening and empathy that I apply in projects and collaborative environments."
      },
      "communication": {
        "name": "Communication",
        "description": "Communication and assertiveness have been key to achieving good results in the projects and challenges I have faced."
      },
      "stress-management": {
        "name": "Stress management",
        "description": "As a claims specialist, managing stress and maintaining a steady pace has always been key to success in my work."
      },
      "problem-solving": {
        "name": "Problem solving",
        "description": "This skill was essential for analyzing my company's processes and proposing effective solutions."
      },
      "teamwork": {
        "name": "Teamwork",
        "description": "Coordinating and redirecting colleagues' work on a daily basis has been crucial for the company's continuous improvement."
      },
      "adaptability": {
        "name": "Adaptability",
        "description": "Working in a newly created customer service team without defined processes, and later in one with different simultaneous telephone services, sharpened my adaptability."
      }
    }
  }
}