{
  "subtitle-1": "Desarrollador",
  "subtitle-2": "Entusiasta",
  "side-bar": {
    "about": "Sobre mí",
    "skills": "Habilidades",
    "projects": "Proyectos"
  },
  "about": {
    "title": "Sobre mí",
    "greeting": "Hola soy Roger",
    "paragraph1": "Soy un apasionado del desarrollo web que ha cambiado de carrera para seguir su verdadera vocación. Me encanta crear experiencias digitales que sean funcionales, intuitivas y que realmente aporten valor a los usuarios. Para lograrlo, he construido una base sólida en tecnologías como HTML, CSS, JavaScript, SQL, MongoDB, PHP y Java, además de frameworks como Angular, React y Laravel. Durante mi formación y proyectos personales, he creado aplicaciones web completas, poniendo especial atención en la experiencia del usuario y la optimización, aplicando principios de UI/UX. Uno de mis proyectos favoritos fue desarrollar una API en Laravel para reservas de alojamientos, que puedes ver en mi GitHub.",
    "paragraph2": "Actualmente no estoy especializado en ningún stack, ya que disfruto explorando todo lo que el desarrollo web tiene para ofrecer y aprendo con avidez. No descarto que en el futuro encuentre mi área de especialización, pero por ahora prefiero mantener una mente abierta a cualquier tecnología o conocimiento, porque el mundo del desarrollo me ofrece mucho para descubrir y aprovechar.",
    "paragraph3": "Antes de dedicarme al desarrollo, trabajé en atención al cliente y análisis de procesos, lo que me ayudó a entender mejor las necesidades reales de los usuarios y a aportar un enfoque analítico a mis proyectos. Ahora, busco mi primer reto profesional en desarrollo web, con ganas de aportar lo que sé, seguir aprendiendo y crecer en un entorno colaborativo donde la mejora continua sea parte del día a día."
  },
  "skills": {
    "title": "Habilidades",
    "title-hard": "Capacidades técnicas",
    "title-soft": "Capacidades personales",
    "gallery-thumbnails-label": "Miniaturas del proyecto",
    "soft-skills": {
      "active-listening": {
        "name": "Escucha activa",
        "description": "Gracias a mi experiencia previa, desarrollé un alto nivel de escucha activa y empatía que aplico en los proyectos y entornos colaborativos."
      },
      "communication": {
        "name": "Comunicación",
        "description": "La comunicación y la asertividad han sido claves para obtener buenos resultados en los proyectos y retos que he afrontado."
      },
      "stress-management": {
        "name": "Gestión del estrés",
        "description": "Como agente especializado en reclamaciones, gestionar el estrés y mantener un buen ritmo siempre ha sido clave para el éxito en mi trabajo."
      },
      "problem-solving": {
        "name": "Resolución de problemas",
        "description": "Esta capacidad fue esencial para analizar los procesos de mi empresa y proponer soluciones eficaces."
      },
      "teamwork": {
        "name": "Trabajo en equipo",
        "description": "Coordinar y reconducir el trabajo de mis compañeros día a día ha sido una labor clave para la mejora continua de la empresa."
      },
      "adaptability": {
        "name": "Adaptabilidad",
        "description": "Haber trabajado en un servicio de atención recién creado, sin procesos definidos, y después en uno con distintos servicios telefónicos simultáneos agudizó mi capacidad de adaptación."
      }
    }
  },
  "projects": {
    "title": "Proyectos",
    "viewDetails": "Ver detalles del proyecto",
    "demo-urls": "URLs de demostración",
    "repo-urls": "Repositorios",
    "roles": "Roles",
    "main-skills": "Habilidades principales",
    "secondary-skills": "Habilidades secundarias",
    "related-skills": "Habilidades relacionadas",
    "description-title": "Descripción del proyecto",
    "project-descriptions": {
      "hostcontrol": {
        "short": "TFG del ciclo DAW: desarrollé la API, la base de datos y parte clave de la documentación técnica de una plataforma de gestión de alojamientos.",
        "long": "HostControl es una plataforma web desarrollada como Trabajo de Fin de Grado (TFG) del ciclo de DAW. El objetivo del proyecto era crear un sistema completo de gestión para complejos turísticos como campings, casas rurales o bungalows, permitiendo controlar alojamientos, reservas, servicios adicionales y administración interna desde un único panel. Mi rol principal fue el desarrollo de toda la lógica de back-end: diseñé y programé la API RESTful con Laravel, estructuré la base de datos relacional en MariaDB y elaboré gran parte de la documentación técnica del sistema. También implementé el sistema de autenticación con Laravel Sanctum, validaciones complejas, soporte multidioma desde la API y control de logs. Además, el despliegue del sistema se realizó en Google Cloud utilizando Terraform, Ansible y Cloud Build, aunque esta parte la lideró otro compañero del equipo.",
        "extra": "Después de finalizar el proyecto académico, realicé por mi cuenta un despliegue completo en una Raspberry Pi 5 utilizando Docker y Nginx como proxy inverso. Automatizé las actualizaciones mediante scripts personalizados que comprueban si hay cambios en el repositorio, y en caso afirmativo, aplican los cambios, eliminan y recrean los contenedores. El resultado es una aplicación profesional, escalable y bien documentada, lista para ser presentada en un entorno real o productivo."
      },
      "raspi-server": {
        "short": "Servidor personal basado en Raspberry Pi 5 donde despliego y actualizo mis proyectos web usando Docker, Nginx y scripts Bash personalizados.",
        "long": "Este proyecto es una guía y configuración real de un servidor personal basado en Raspberry Pi 5, creado para desplegar y gestionar mis propios proyectos web. El servidor utiliza Docker y Nginx como proxy inverso, con una estructura organizada por tipo de proyecto (frontend, backend, fullstack). Se configuró con autenticación SSH por clave, UFW y rutas de despliegue estandarizadas. Aunque nació como soporte para mostrar el proyecto HostControl, el sistema también aloja múltiples proyectos bajo subdominios personalizados, utilizando túneles Cloudflare y buenas prácticas de administración segura.",
        "extra": "Desarrollé una serie de scripts Bash reutilizables que automatizan el despliegue de proyectos Dockerizados. Estos scripts detectan actualizaciones en los repositorios, construyen nuevas imágenes, eliminan contenedores antiguos y lanzan nuevos, todo con políticas de reinicio configuradas. Además, utilicé Cloudflare Tunnel para exponer los servicios de forma segura y configuré un servicio systemd que garantiza el arranque automático y la recuperación en caso de fallo. Todo el sistema es modular, replicable y evoluciona con cada nuevo proyecto que añado a mi entorno."
      },
      "coffee-haven": {
        "short": "Aplicación web en Angular desarrollada como práctica académica para la asignatura de desarrollo en entorno cliente del ciclo DAW.",
        "long": "CoffeeHaven es una aplicación construida con Angular como parte de una práctica del módulo de Desarrollo Web en Entorno Cliente del ciclo de FP DAW. Simula una tienda de café online en la que los usuarios pueden explorar productos, navegar entre páginas, autenticarse y realizar pedidos. La aplicación sigue una arquitectura moderna basada en componentes, servicios, rutas protegidas y modelos, e incluye un sistema de despliegue Dockerizado con Nginx para entornos de producción o demostración.",
        "extra": "Este proyecto, aunque modesto, me permitió introducirme en Angular y comprender su estructura basada en módulos, servicios y rutas. También experimenté con la configuración de guardas de rutas y la separación lógica en carpetas. Como añadido, preparé un entorno de despliegue con Docker y Nginx configurado para servir aplicaciones SPA, lo cual me permitió integrarlo fácilmente en mi servidor personal."
      },
      "roger-portfolio": {
        "short": "Portfolio web personal desarrollado en React y Tailwind CSS para presentar mis proyectos, habilidades y formación como desarrollador web.",
        "long": "Este portfolio fue desarrollado desde cero con React y Tailwind CSS para mostrar mis proyectos académicos y personales, habilidades técnicas y blandas, así como mi experiencia previa. La estructura está dividida en secciones claras como Sobre mí, Habilidades, Proyectos, Experiencia y Contacto. Incluye soporte multidioma mediante un contexto personalizado que gestiona los textos dinámicos en español e inglés, sin depender de librerías externas.",
        "extra": "El diseño del portfolio está basado en componentes reutilizables y una interfaz limpia gracias al uso de Tailwind CSS. La gestión del estado se realiza con hooks de React como useState y useEffect, y los datos de proyectos se organizan en archivos JavaScript externos para facilitar su mantenimiento. Todo el sistema refleja tanto mi perfil técnico como mi interés por la accesibilidad, la estructura clara y la experiencia de usuario."
      },
      "horse-race-game": {
        "short": "Aplicación de escritorio desarrollada en equipo con JavaFX, centrada en una carrera de caballos interactiva con sistema de apuestas, animaciones y lógica de juego por turnos.",
        "long": "Proyecto académico grupal realizado en JavaFX, en el que los tres integrantes colaboramos en las diferentes partes del desarrollo: interfaz gráfica, lógica del juego, estructura de datos y persistencia. La aplicación simula una carrera de caballos basada en cartas de la baraja española, en la que jugadores humanos o bots pueden apostar fichas y competir hasta que uno de los caballos cruce la meta. El sistema incluye gestión de apuestas, eliminación por bancarrota, clasificación dinámica y una experiencia visual enriquecida gracias a la animación y el uso de escenas FXML.",
        "extra": "El código está organizado siguiendo el patrón MVC, dividiendo la lógica de negocio, los controladores de vista y las interfaces gráficas. Además, el proyecto incluye diagramas UML, estilos CSS propios y utilidades para la serialización de datos y la gestión del flujo del juego. Fue una experiencia completa de trabajo en equipo que incluyó planificación, programación, pruebas y presentación final."
      }
    },
    "image-descriptions": {
      "hostcontrol-stack": "Diagrama técnico del stack de tecnologías usado en HostControl",
      "hostcontrol-relational": "Diagrama relacional de la base de datos de HostControl",
      "hostcontrol-postman": "Captura de una respuesta HTTP de la API de HostControl mostrada en Postman",
      "hostcontrol-home": "Captura de la página de inicio del frontend de HostControl",
      "hostcontrol-panel": "Captura del panel de control de administración en HostControl",
      "raspi-server-cover": "Imagen de portada del servidor web basado en Raspberry Pi 5",
      "raspi-server-hardware": "Fotografía de la Raspberry Pi con la carcasa abierta",
      "raspi-server-code": "Captura de un script Bash utilizado en el servidor Raspberry Pi",
      "raspi-server-script-running": "Script Bash ejecutándose en el servidor Raspberry Pi",
      "coffee-haven-home": "Captura de la página de inicio de Coffee Haven",
      "coffee-haven-form": "Formulario para añadir cafés en Coffee Haven",
      "coffee-haven-panel": "Panel de control de Coffee Haven utilizado para gestionar pedidos",
      "coffee-haven-detail": "Página de detalles de uno de los cafés en Coffee Haven",
      "roger-portfolio-home": "Captura de la página de inicio del portfolio personal",
      "roger-portfolio-responsive": "Capturas de la sección de habilidades y del menú en vista móvil, mostrando el diseño responsive",
      "horse-race-game-home": "Pantalla de inicio del juego de apuestas de caballos",
      "horse-race-game-setup": "Configuración de una nueva partida con jugadores humanos y bots",
      "horse-race-game-bets": "Pantalla donde los jugadores apuestan fichas por su caballo elegido",
      "horse-race-game-board": "Tablero animado donde los caballos avanzan según las cartas",
      "horse-race-game-result": "Resultado final de la carrera con los cambios en clasificación y apuestas"
    }
  },
  "contact": {
    "contact-me": "Contáctame",
    "social-paragraph": "Aquí puedes consultar mis redes profesionales y descargar mi CV:",
    "contact-paragraph": "O si lo prefieres, escríbeme directamente:",
    "form": {
      "send-button": "Enviar",
      "cant-send-button": "Revisa los campos",
      "name-label": "Nombre",
      "email-label": "Correo electrónico",
      "message-label": "Mensaje",
      "name-placeholder": "Tu nombre completo",
      "email-placeholder": "tu@email.com",
      "message-placeholder": "¿En qué puedo ayudarte?",
      "succesful-submit-1": "✅ ¡Mensaje enviado correctamente!",
      "succesful-submit-2": "📨 Te responderé lo antes posible.",
      "errors": {
        "required": "Este campo es obligatorio.",
        "name": "Este campo debe tener al menos 3 letras y solo puede contener letras y espacios.",
        "email": "Introduce un correo electrónico válido.",
        "message": "Este campo debe tener al menos 10 caracteres y no más de 300."
      }
    }
  }
}